resources/langs/fortran/index.org
#+title: ACM Computing Seminar Fortran Guide
#+author: Joseph P. McKenna
#+email: joepatmckenna@gmail.com
#+property: header-args :mkdirp yes :cache yes
#+property: header-args:fortran :exports code
#+property: header-args:sh :exports both
#+startup: latexpreview
#+options: html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="../css/main.css">
#+html_head: <script src="../js/main.js"></script>
#+html: <div id="main">
#+html: <a href="../../../" id="home-link">ACM Computing Seminar Home</a>

* Introduction
This is guide is intended to quickly get you up-and-running in scientific computing with Fortran. There is a companion [[../cpp/index.html][C++ guide]] that parallels the content of this guide. 
** About the language
Fortran was created in the 1950s for mathematical *FOR*-mula *TRAN*-slation, and has since gone through a number of revisions (FORTRAN 66, 77, and Fortran 90, 95, 2003, 2008, 2015). The language standards are put forth by the Fortran standard committee [[http://www.j3-fortran.org][J3]] in a document (ISO 1539-1:2010) available for purchase. The syntax and intrinsic capabilities of the language make it especially suited for scientific computing. Like C/C++, Fortran is a *statically-typed* and *compiled* language. You must declare the *type*, i.e. integer, real number, character, of variables in programs you write. Your programs will be translated from human-readable /source code/ into a machine-executable file by software called a *compiler*. 

* Getting started
The software that you need to get started comes prepackaged and ready to download on most Linux distributions. There are a few options for emulating a Linux environment in Windows or Mac OS, such as a virtual machine (VirtualBox) or package manager (MinGW or Cygwin on Windows and Brew on Mac OS).
** Text editor
You will write the source code of your programs using a text editor. There are many options that have features designed for programming such as syntax highlighting and auto-completion. If you are an impossible-to-please perfectionist, you might want to check out [[https://www.gnu.org/s/emacs/][Emacs]]. If you are easier to please, you might want to check out [[https://www.sublimetext.com/][Sublime Text]].
** Compiler
To translate your source code into an executable, you will need a Fortran compiler. A free option is *gfortran*, part of the GNU compiler collection (gcc). The features of the Fortran language that are supported by the compiler are specified in the compiler documentation. This is your most complete reference for the intrinsic capabilities of Fortran that your programs can use. At the time of this writing, =gfortran= completely supports Fortran 95 and partially supports more recent standards.
** Writing a program
*** Hello world
Let's write a tiny program that prints "hello world" to the terminal screen in =hello.f90=

#+begin_src fortran -n :tangle hello/hello.f90
  program main
    print*, 'hello world'
  end program main
#+end_src

To compile the program, execute the following command in the same directory as =hello.f90=

#+begin_src sh :dir hello
  gfortran hello.f90
#+end_src

This produces an executable file named =a.out= by default. To run, execute the following command in the same directory 

#+begin_src sh :dir hello
  ./a.out
#+end_src

We could have specified a different name for the executable file during compilation with the =-o= option of =gfortran=

#+begin_src sh :dir hello
  gfortran hello.f90 -o my_executable_file
#+end_src

