resources/langs/fortran/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-21 Sun 23:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>ACM Computing Seminar Fortran Guide</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Joseph P. McKenna" />
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="content">
<h1 class="title">ACM Computing Seminar Fortran Guide</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. Introduction</a>
<ul>
<li><a href="#orgheadline1">1.1. About the language</a></li>
</ul>
</li>
<li><a href="#orgheadline8">2. Getting started</a>
<ul>
<li><a href="#orgheadline3">2.1. Text editor</a></li>
<li><a href="#orgheadline4">2.2. Compiler</a></li>
<li><a href="#orgheadline7">2.3. Writing a program</a>
<ul>
<li><a href="#orgheadline5">2.3.1. Hello world</a></li>
<li><a href="#orgheadline6">2.3.2. Template</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline18">3. Data types</a>
<ul>
<li><a href="#orgheadline10">3.1. The <code>logical</code> type</a></li>
<li><a href="#orgheadline11">3.2. The <code>integer</code> type</a></li>
<li><a href="#orgheadline12">3.3. Floating point types</a></li>
<li><a href="#orgheadline13">3.4. Casting</a></li>
<li><a href="#orgheadline14">3.5. The <code>parameter</code> modifier</a></li>
<li><a href="#orgheadline15">3.6. Setting the precision</a></li>
<li><a href="#orgheadline16">3.7. Pointers</a></li>
<li><a href="#orgheadline17">3.8. Arrays</a></li>
</ul>
</li>
<li><a href="#orgheadline9">4. Control structures</a></li>
</ul>
</div>
</div>
<div id="main">
<a href="../../../" id="home-link">ACM Computing Seminar Home</a>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is guide is intended to quickly get you up-and-running in scientific computing with Fortran. There is a companion <a href="../cpp/index.html">C++ guide</a> that parallels the content of this guide. 
</p>
</div>
<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> About the language</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Fortran was created in the 1950s for mathematical <b>FOR</b>-mula <b>TRAN</b>-slation, and has since gone through a number of revisions (FORTRAN 66, 77, and Fortran 90, 95, 2003, 2008, 2015). The language standards are put forth by the Fortran standard committee <a href="http://www.j3-fortran.org/">J3</a> in a document (ISO 1539-1:2010) available for purchase. The syntax and intrinsic capabilities of the language make it especially suited for scientific computing. Like C/C++, Fortran is a <b>statically-typed</b> and <b>compiled</b> language. You must declare the <b>type</b>, i.e. integer, real number, character, of variables in programs you write. Your programs will be translated from human-readable <i>source code</i> into a machine-executable file by software called a <b>compiler</b>. 
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">2</span> Getting started</h2>
<div class="outline-text-2" id="text-2">
<p>
The software that you need to get started comes prepackaged and ready to download on most Linux distributions. There are a few options for emulating a Linux environment in Windows or Mac OS, such as a virtual machine (VirtualBox) or package manager (MinGW or Cygwin on Windows and Brew on Mac OS).
</p>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.1</span> Text editor</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You will write the source code of your programs using a text editor. There are many options that have features designed for programming such as syntax highlighting and auto-completion. If you are an impossible-to-please perfectionist, you might want to check out <a href="https://www.gnu.org/s/emacs/">Emacs</a>. If you are easier to please, you might want to check out <a href="https://www.sublimetext.com/">Sublime Text</a>.
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.2</span> Compiler</h3>
<div class="outline-text-3" id="text-2-2">
<p>
To translate your source code into an executable, you will need a Fortran compiler. A free option is <b>gfortran</b>, part of the GNU compiler collection (gcc). The features of the Fortran language that are supported by the compiler are specified in the compiler documentation. This is your most complete reference for the intrinsic capabilities of Fortran that your programs can use. At the time of this writing, <code>gfortran</code> completely supports Fortran 95 and partially supports more recent standards.
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.3</span> Writing a program</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">2.3.1</span> Hello world</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Let's write a tiny program that prints "hello world" to the terminal screen in <code>hello.f90</code>
</p>

<div class="org-src-container">

<pre class="src src-fortran"><span class="linenr">1: </span><span style="color: #0000FF;">program</span> <span style="color: #006699;">main</span>
<span class="linenr">2: </span>  <span style="color: #0000FF;">print</span>*, <span style="color: #008000;">'hello world'</span>
<span class="linenr">3: </span><span style="color: #0000FF;">end program</span> <span style="color: #006699;">main</span>
</pre>
</div>

<p>
To compile the program, execute the following command in the same directory as <code>hello.f90</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">gfortran hello.f90
</pre>
</div>

<p>
This produces an executable file named <code>a.out</code> by default. To run, execute the following command in the same directory 
</p>

<div class="org-src-container">

<pre class="src src-sh">./a.out
</pre>
</div>

<pre class="example">
hello world
</pre>

<p>
We could have specified a different name for the executable file during compilation with the <code>-o</code> option of <code>gfortran</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">gfortran hello.f90 -o my_executable_file
</pre>
</div>
</div>
</div>
