resources/langs/fortran/index.org
*** Template
Now let's write an empty template for future projects. This section may seem overly complex at first read, but it is best to adopt some form of organization when you are just getting started. Our source code template will consist of two files in the same directory ([[./template/]]). In the following files, the contents of a line after a =!= symbol is a comment that is ignored by the compiler. One file =header.f90= is a *module* that defines variables and procedures to be used later.

#+begin_src fortran -n -r :tangle template/header.f90
  module header
    implicit none (ref:in1)
    ! variable declarations and assignments
  contains
    ! function and subroutine definitions
  end module header
#+end_src

This file is compiled into an *object file* with the =-c= option of =gfortran=

#+begin_src sh :dir template
gfortran -c header.f90
#+end_src

This outputs the object file named =header.o= by default that can be /linked/ to the main program. A separate file =main.f90= contains the main program

#+begin_src fortran -n -r :tangle template/main.f90
  program main
    use header (ref:use)
    implicit none (ref:in2)
    ! variable declarations and assignments
    ! function and subroutine calls
  contains
    ! function and subroutine definitions
  end program main
#+end_src

On line [[(use)]], we imported the content of =header.f90= into the main program, so we must link the object file =header.o= when compiling =main.f90=

#+begin_src sh :dir template
gfortran main.f90 header.o -o main
#+end_src

To run the program, execute the output file =main= in the same directory

#+begin_src sh :dir template
./main
#+end_src

.

As you get more experience, you will find it very cumbersome to repeatedly execute =gfortran= commands with every modification to your code. Using the =make= command-line utility is a way around this. You can specify all the compilation commands for your project in a =makefile=. For example, the template above could use the following =makefile=

#+begin_src make -n -r :exports code :tangle template/makefile
  FC = gfortran
  SRC = main.f90
  EXE = main
  OBJ = header.o (ref:obj)

  all: $(EXE)
  $(EXE): $(OBJ)
    $(FC) $(OBJ) $(SRC) -o $(EXE)
  %.o: %.f90
    $(FC) -c $< -o $@
#+end_src

Then, to recompile both =header.f90= and =main.f90= after modifying either file, you would execute

#+begin_src sh :dir template
make
#+end_src

The first four lines of =makefile= assign variables for the compiler command, file name of the main program, file name of the executable to be created, and file name(s) of linked object files, respectively. If you wrote a second module in a separate file =my_second_header.f90= that you wanted to =use= in =main.f90=, you would modify line [[(obj)]] to =OBJ = header.o my_second_header.o=.

* Data types
We will use the convention of putting an =implicit none= keyword at the beginning of each code block as in line [[(in1)]] of =header.f90= and line [[(in2)]] of =main.f90= in Section [[Template]]. The role of this keyword is to suppress some implicit rules that Fortran has for undeclared variables. Without this keyword, an undeclared variable with a name such as =i= is assumed to be of the integer data type whereas an undeclared variable with a name such as =x= is assumed to be a real data type. By using the =implicit none= keyword, we force ourselves to declare every variable that we use. This may ultimately lead to more code but it is recommended to facilitate debugging when your program fails to compile. In addition to the most common data types presented below, Fortran has =complex= and =character= data types and support for user-defined data types.
