resources/langs/fortran/index.html

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">2.3.2</span> Template</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Now let's write an empty template for future projects. This section may seem overly complex at first read, but it is best to adopt some form of organization when you are just getting started. Our source code template will consist of two files in the same directory (<a href="./template/">./template/</a>). In the following files, the contents of a line after a <code>!</code> symbol is a comment that is ignored by the compiler. One file <code>header.f90</code> is a <b>module</b> that defines variables and procedures to be used later.
</p>

<div class="org-src-container">

<pre class="src src-fortran"><span class="linenr">1: </span><span style="color: #0000FF;">module</span> <span style="color: #006699;">header</span>
<span id="coderef-in1" class="coderef-off"><span class="linenr">2: </span>  <span style="color: #0000FF;">implicit</span> <span style="color: #6434A3;">none</span></span>
<span class="linenr">3: </span>  <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">variable declarations and assignments</span>
<span class="linenr">4: </span><span style="color: #0000FF;">contains</span>
<span class="linenr">5: </span>  <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">function and subroutine definitions</span>
<span class="linenr">6: </span><span style="color: #0000FF;">end module</span> <span style="color: #006699;">header</span>
</pre>
</div>

<p>
This file is compiled into an <b>object file</b> with the <code>-c</code> option of <code>gfortran</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">gfortran -c header.f90
</pre>
</div>

<p>
This outputs the object file named <code>header.o</code> by default that can be <i>linked</i> to the main program. A separate file <code>main.f90</code> contains the main program
</p>

<div class="org-src-container">

<pre class="src src-fortran"><span class="linenr">1: </span><span style="color: #0000FF;">program</span> <span style="color: #006699;">main</span>
<span id="coderef-use" class="coderef-off"><span class="linenr">2: </span>  <span style="color: #0000FF;">use</span> <span style="color: #006699;">header</span></span>
<span id="coderef-in2" class="coderef-off"><span class="linenr">3: </span>  <span style="color: #0000FF;">implicit</span> <span style="color: #6434A3;">none</span></span>
<span class="linenr">4: </span>  <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">variable declarations and assignments</span>
<span class="linenr">5: </span>  <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">function and subroutine calls</span>
<span class="linenr">6: </span><span style="color: #0000FF;">contains</span>
<span class="linenr">7: </span>  <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">function and subroutine definitions</span>
<span class="linenr">8: </span><span style="color: #0000FF;">end program</span> <span style="color: #006699;">main</span>
</pre>
</div>

<p>
On line <a href="#coderef-use"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-use');" onmouseout="CodeHighlightOff(this, 'coderef-use');">2</a>, we imported the content of <code>header.f90</code> into the main program, so we must link the object file <code>header.o</code> when compiling <code>main.f90</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">gfortran main.f90 header.o -o main
</pre>
</div>

<p>
To run the program, execute the output file <code>main</code> in the same directory
</p>

<div class="org-src-container">

<pre class="src src-sh">./main
</pre>
</div>

<p>
.
</p>

<p>
As you get more experience, you will find it very cumbersome to repeatedly execute <code>gfortran</code> commands with every modification to your code. Using the <code>make</code> command-line utility is a way around this. You can specify all the compilation commands for your project in a <code>makefile</code>. For example, the template above could use the following <code>makefile</code>
</p>

<div class="org-src-container">

<pre class="src src-make"><span class="linenr"> 1: </span><span style="color: #BA36A5;">FC</span> = gfortran
<span class="linenr"> 2: </span><span style="color: #BA36A5;">SRC</span> = main.f90
<span class="linenr"> 3: </span><span style="color: #BA36A5;">EXE</span> = main
<span id="coderef-obj" class="coderef-off"><span class="linenr"> 4: </span><span style="color: #BA36A5;">OBJ</span> = header.o</span>
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #0000ff; font-weight: bold;">all</span>: $<span style="color: #707183;">(</span><span style="color: #BA36A5;">EXE</span><span style="color: #707183;">)</span>
<span class="linenr"> 7: </span><span style="color: #0000ff; font-weight: bold;">$</span><span style="color: #707183; font-weight: bold;">(</span><span style="color: #0000ff; font-weight: bold;">EXE</span><span style="color: #707183; font-weight: bold;">)</span>: $<span style="color: #707183;">(</span><span style="color: #BA36A5;">OBJ</span><span style="color: #707183;">)</span>
<span class="linenr"> 8: </span>  $<span style="color: #707183;">(</span><span style="color: #BA36A5;">FC</span><span style="color: #707183;">)</span> $<span style="color: #707183;">(</span><span style="color: #BA36A5;">OBJ</span><span style="color: #707183;">)</span> $<span style="color: #707183;">(</span><span style="color: #BA36A5;">SRC</span><span style="color: #707183;">)</span> -o $<span style="color: #707183;">(</span><span style="color: #BA36A5;">EXE</span><span style="color: #707183;">)</span>
<span class="linenr"> 9: </span><span style="color: #0000ff; font-weight: bold;">%.o</span>: %.f90
<span class="linenr">10: </span>  $<span style="color: #707183;">(</span><span style="color: #BA36A5;">FC</span><span style="color: #707183;">)</span> -c $<span style="color: #D0372D;">&lt;</span> -o <span style="color: #0000ff; font-weight: bold;">$</span><span style="color: #D0372D; font-weight: bold;">@</span>
</pre>
</div>

<p>
Then, to recompile both <code>header.f90</code> and <code>main.f90</code> after modifying either file, you would execute
</p>

<div class="org-src-container">

<pre class="src src-sh">make
</pre>
</div>

<p>
The first four lines of <code>makefile</code> assign variables for the compiler command, file name of the main program, file name of the executable to be created, and file name(s) of linked object files, respectively. If you wrote a second module in a separate file <code>my_second_header.f90</code> that you wanted to <code>use</code> in <code>main.f90</code>, you would modify line <a href="#coderef-obj"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-obj');" onmouseout="CodeHighlightOff(this, 'coderef-obj');">4</a> to <code>OBJ = header.o my_second_header.o</code>.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">3</span> Data types</h2>
<div class="outline-text-2" id="text-3">
<p>
We will use the convention of putting an <code>implicit none</code> keyword at the beginning of each code block as in line <a href="#coderef-in1"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-in1');" onmouseout="CodeHighlightOff(this, 'coderef-in1');">2</a> of <code>header.f90</code> and line <a href="#coderef-in2"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-in2');" onmouseout="CodeHighlightOff(this, 'coderef-in2');">3</a> of <code>main.f90</code> in Section <a href="#orgheadline6">2.3.2</a>. The role of this keyword is to suppress some implicit rules that Fortran has for undeclared variables. Without this keyword, an undeclared variable with a name such as <code>i</code> is assumed to be of the integer data type whereas an undeclared variable with a name such as <code>x</code> is assumed to be a real data type. By using the <code>implicit none</code> keyword, we force ourselves to declare every variable that we use. This may ultimately lead to more code but it is recommended to facilitate debugging when your program fails to compile. In addition to the most common data types presented below, Fortran has <code>complex</code> and <code>character</code> data types and support for user-defined data types.
</p>
</div>
