resources/langs/fortran/index.org
** The =logical= type
A variable of the =logical= type can have values =.true.= or =.false.=. Logical operations can be computed with a few operators 

#+begin_src fortran -n 
  logical :: a,b,c
  a = .true.
  b = .false.

  ! '.not.' is the logical negation operator
  c = .not.a ! c is false

  ! '.and,' is the logical and operator
  c = a.and.b ! c is false

  ! '.or.' is the logical or operator
  c = a.or.b ! c is true

  ! '==' is the test for equality
  c = (1 == 2) ! c is false

  ! '/=' is test for inequality
  c = (1 /= 2) ! c is true
#+end_src

Other logical operators include
- =<= or =.lt.=: less than
- =<== or =.le.=: less than or equal
- =>= or =.gt.=: greater than
- =>== or =.ge.=: greater than or equal

Logical expressions are often used in [[Control structures][control structures]].

** The =integer= type

#+begin_src fortran -n
    integer :: a = 6, b = 7 ! initialize a and b to 6 and 7, resp
    integer :: c

    c = a / b ! c is 0
    c = b / a ! c is 1
    c = mod(b,a) ! c is 1, 'mod' is the modulo operator
    c = b - a ! c is -1
    c = a > b ! c is 0 (logical gets cast to integer)
    c = a < b ! c is 1 (logical gets cast to integer)
#+end_src

** Floating point types
There are two floating point data types in Fortran, =real= and =double precision= corresponding to [[https://en.wikipedia.org/wiki/IEEE_floating_poin][IEEE 32- and 64-bit floating point data types]].

#+begin_src fortran :exports both -n
  real :: a ! declare a single precision float
  double precision :: b ! declare a double precision float

  ! Print the max value of a real type
  print*, huge(a)

  ! Print the max value of a double precision type
  print*, huge(b)

  ! Print machine epsilon for the single precision floating point system
  print*, epsilon(a)

  ! Print machine epsilon for the double precision floating point system
  print*, epsilon(b)
#+end_src

** Casting
An integer can be cast to a real number or vice versa.

#+begin_src fortran :exports both -n
    integer :: a = 1, b
    real :: PI = 3.14159

    b = int(PI) ! b is 3
    print*, a/b
    print*, a/real(b)
#+end_src

** The =parameter= modifier
To protect a variable of any data type from reassignment, you can use the =parameter= modifier. If this modifier is used, the corresponding variable must be assigned a value at declaration, and that value cannot be reassigned. The following code is not valid.

#+begin_src fortran -n
  real, parameter :: PI = asin(0.)
  PI = 3
#+end_src

The compiler produces an error like =Error: Named constant ‘pi’ in variable definition context (assignment)=.

