resources/langs/fortran/index.html
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">3.1</span> The <code>logical</code> type</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A variable of the <code>logical</code> type can have values <code>.true.</code> or <code>.false.</code>. Logical operations can be computed with a few operators 
</p>

<div class="org-src-container">

<pre class="src src-fortran"><span class="linenr"> 1: </span><span style="color: #6434A3;">logical</span> ::<span style="color: #BA36A5;"> a,b,c</span>
<span class="linenr"> 2: </span>a = <span style="color: #0000FF;">.true.</span>
<span class="linenr"> 3: </span>b = <span style="color: #0000FF;">.false.</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">'.not.' is the logical negation operator</span>
<span class="linenr"> 6: </span>c = <span style="color: #0000FF;">.not.</span>a <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is false</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">'.and,' is the logical and operator</span>
<span class="linenr"> 9: </span>c = a<span style="color: #0000FF;">.and.</span>b <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is false</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">'.or.' is the logical or operator</span>
<span class="linenr">12: </span>c = a<span style="color: #0000FF;">.or.</span>b <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is true</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">'==' is the test for equality</span>
<span class="linenr">15: </span>c = <span style="color: #707183;">(</span><span style="color: #D0372D;">1</span> == <span style="color: #D0372D;">2</span><span style="color: #707183;">)</span> <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is false</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">'/=' is test for inequality</span>
<span class="linenr">18: </span>c = <span style="color: #707183;">(</span><span style="color: #D0372D;">1</span> /= <span style="color: #D0372D;">2</span><span style="color: #707183;">)</span> <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is true</span>
</pre>
</div>

<p>
Other logical operators include
</p>
<ul class="org-ul">
<li><code>&lt;</code> or <code>.lt.</code>: less than</li>
<li><code>&lt;=</code> or <code>.le.</code>: less than or equal</li>
<li><code>&gt;</code> or <code>.gt.</code>: greater than</li>
<li><code>&gt;=</code> or <code>.ge.</code>: greater than or equal</li>
</ul>

<p>
Logical expressions are often used in <a href="#orgheadline9">control structures</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.2</span> The <code>integer</code> type</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-fortran"><span class="linenr">1: </span><span style="color: #6434A3;">integer</span> ::<span style="color: #BA36A5;"> a = 6, b = 7 </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">initialize a and b to 6 and 7, resp</span>
<span class="linenr">2: </span><span style="color: #6434A3;">integer</span> ::<span style="color: #BA36A5;"> c</span>
<span class="linenr">3: </span>
<span class="linenr">4: </span>c = a / b <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is 0</span>
<span class="linenr">5: </span>c = b / a <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is 1</span>
<span class="linenr">6: </span>c = <span style="color: #0000FF;">mod</span><span style="color: #707183;">(</span>b,a<span style="color: #707183;">)</span> <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is 1, 'mod' is the modulo operator</span>
<span class="linenr">7: </span>c = b - a <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is -1</span>
<span class="linenr">8: </span>c = a &gt; b <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is 0 (logical gets cast to integer)</span>
<span class="linenr">9: </span>c = a &lt; b <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">c is 1 (logical gets cast to integer)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.3</span> Floating point types</h3>
<div class="outline-text-3" id="text-3-3">
<p>
There are two floating point data types in Fortran, <code>real</code> and <code>double precision</code> corresponding to <a href="https://en.wikipedia.org/wiki/IEEE_floating_poin">IEEE 32- and 64-bit floating point data types</a>.
</p>

<div class="org-src-container">

<pre class="src src-fortran"><span style="color: #6434A3;">real</span> ::<span style="color: #BA36A5;"> a </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">declare a single precision float</span>
<span style="color: #6434A3;">double precision</span> ::<span style="color: #BA36A5;"> b </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">declare a double precision float</span>

<span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Print the max value of a real type</span>
<span style="color: #0000FF;">print</span>*, <span style="color: #0000FF;">huge</span><span style="color: #707183;">(</span>a<span style="color: #707183;">)</span>

<span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Print the max value of a double precision type</span>
<span style="color: #0000FF;">print</span>*, <span style="color: #0000FF;">huge</span><span style="color: #707183;">(</span>b<span style="color: #707183;">)</span>

<span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Print machine epsilon for the single precision floating point system</span>
<span style="color: #0000FF;">print</span>*, <span style="color: #0000FF;">epsilon</span><span style="color: #707183;">(</span>a<span style="color: #707183;">)</span>

<span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Print machine epsilon for the double precision floating point system</span>
<span style="color: #0000FF;">print</span>*, <span style="color: #0000FF;">epsilon</span><span style="color: #707183;">(</span>b<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.4</span> Casting</h3>
<div class="outline-text-3" id="text-3-4">
<p>
An integer can be cast to a real number or vice versa.
</p>

<div class="org-src-container">

<pre class="src src-fortran"><span style="color: #6434A3;">integer</span> ::<span style="color: #BA36A5;"> a = 1, b</span>
<span style="color: #6434A3;">real</span> ::<span style="color: #BA36A5;"> PI = 3.14159</span>

b = <span style="color: #0000FF;">int</span><span style="color: #707183;">(</span>PI<span style="color: #707183;">)</span> <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">b is 3</span>
<span style="color: #0000FF;">print</span>*, a/b
<span style="color: #0000FF;">print</span>*, a/<span style="color: #0000FF;">real</span><span style="color: #707183;">(</span>b<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.5</span> The <code>parameter</code> modifier</h3>
<div class="outline-text-3" id="text-3-5">
<p>
To protect a variable of any data type from reassignment, you can use the <code>parameter</code> modifier. If this modifier is used, the corresponding variable must be assigned a value at declaration, and that value cannot be reassigned. The following code is not valid.
</p>

<div class="org-src-container">

<pre class="src src-fortran"><span class="linenr">1: </span><span style="color: #6434A3;">real</span>, <span style="color: #0000FF;">parameter</span> ::<span style="color: #BA36A5;"> PI = asin</span><span style="color: #707183;">(</span><span style="color: #BA36A5;">0.</span><span style="color: #707183;">)</span>
<span class="linenr">2: </span>PI = <span style="color: #D0372D;">3</span>
</pre>
</div>

<p>
The compiler produces an error like <code>Error: Named constant ‘pi’ in variable definition context (assignment)</code>.
</p>
</div>
</div>
