resources/langs/fortran/index.org
** Setting the precision

Each data type is assigned an integer by the =kind= function. You can write a program in a chosen precision with the =kind= of the precision stored in a variable =rp=. Then, if you want to change the precision, you could change the value of =rp= and recompile. The precision of a variable can be set at declaration and a variable or constant can be cast to a specified precision, each by supplying an extra argument.

#+begin_src fortran -n
  real :: r ! declare a real, single precision by default
  double precision :: d ! declare a double precision
  integer, parameter :: sp = kind(r), dp = kind(d) ! store kinds of 'r' and 'd'
  integer, parameter :: rp = sp ! set current kind

  ! declare 'b' in double precision
  real(dp) :: b

  ! declare 'a' real with precision kind 'rp'
  real(rp) :: a

  ! cast '1' to real with precision kind 'rp' and assign to a
  a = 1.0_rp

  ! cast 'b' to real with precision kind 'rp' and assign to a
  a = real(b,rp)
#+end_src

** Pointers

Pointers have the same meaning in Fortran as in C++: a pointer is a variable that holds the *memory address* for a variable of a specific type. The implementation of pointers is qualitatively different in Fortran than in C++: in Fortran, there is no Fortran function to print the memory address that a pointer stores. A pointer variable is declared with the =pointer= modifier, and a variable that it points to is declared with the =target= modifier. The types of a =pointer= and its =target= must match.

#+begin_src fortran :exports both -n
  ! declare targets and assign values
  integer, target :: a = 1, b = 2
  ! declare pointer
  integer, pointer :: p

  p => a ! Now 'p' has same memory address as 'a'
  p = 2 ! Modify value at address
  print*, a==2 ! 'a' is 2

  p => b ! Now 'p' has same memory address as 'b'
  p = 1 ! Modify value at address
  print*, b==1 ! 'b' is 1

  ! Is 'p' associated with a target?
  print*, associated(p)

  ! Is 'p' associated with the target 'a'?
  print*, associated(p, a)

  ! Point to nowhere
  nullify(p)
#+end_src

** Arrays

