resources/langs/fortran/index.html

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.6</span> Setting the precision</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Each data type is assigned an integer by the <code>kind</code> function. You can write a program in a chosen precision with the <code>kind</code> of the precision stored in a variable <code>rp</code>. Then, if you want to change the precision, you could change the value of <code>rp</code> and recompile. The precision of a variable can be set at declaration and a variable or constant can be cast to a specified precision, each by supplying an extra argument.
</p>

<div class="org-src-container">

<pre class="src src-fortran"><span class="linenr"> 1: </span><span style="color: #6434A3;">real</span> ::<span style="color: #BA36A5;"> r </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">declare a real, single precision by default</span>
<span class="linenr"> 2: </span><span style="color: #6434A3;">double precision</span> ::<span style="color: #BA36A5;"> d </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">declare a double precision</span>
<span class="linenr"> 3: </span><span style="color: #6434A3;">integer</span>, <span style="color: #0000FF;">parameter</span> ::<span style="color: #BA36A5;"> sp = kind</span><span style="color: #707183;">(</span><span style="color: #BA36A5;">r</span><span style="color: #707183;">)</span><span style="color: #BA36A5;">, dp = kind</span><span style="color: #707183;">(</span><span style="color: #BA36A5;">d</span><span style="color: #707183;">)</span><span style="color: #BA36A5;"> </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">store kinds of 'r' and 'd'</span>
<span class="linenr"> 4: </span><span style="color: #6434A3;">integer</span>, <span style="color: #0000FF;">parameter</span> ::<span style="color: #BA36A5;"> rp = sp </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">set current kind</span>
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">declare 'b' in double precision</span>
<span class="linenr"> 7: </span><span style="color: #6434A3;">real</span><span style="color: #707183;">(</span>dp<span style="color: #707183;">)</span> ::<span style="color: #BA36A5;"> b</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">declare 'a' real with precision kind 'rp'</span>
<span class="linenr">10: </span><span style="color: #6434A3;">real</span><span style="color: #707183;">(</span>rp<span style="color: #707183;">)</span> ::<span style="color: #BA36A5;"> a</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">cast '1' to real with precision kind 'rp' and assign to a</span>
<span class="linenr">13: </span>a = <span style="color: #D0372D;">1</span>.<span style="color: #D0372D;">0_rp</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">cast 'b' to real with precision kind 'rp' and assign to a</span>
<span class="linenr">16: </span>a = <span style="color: #0000FF;">real</span><span style="color: #707183;">(</span>b,rp<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">3.7</span> Pointers</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Pointers have the same meaning in Fortran as in C++: a pointer is a variable that holds the <b>memory address</b> for a variable of a specific type. The implementation of pointers is qualitatively different in Fortran than in C++: in Fortran, there is no Fortran function to print the memory address that a pointer stores. A pointer variable is declared with the <code>pointer</code> modifier, and a variable that it points to is declared with the <code>target</code> modifier. The types of a <code>pointer</code> and its <code>target</code> must match.
</p>

<div class="org-src-container">

<pre class="src src-fortran"><span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">declare targets and assign values</span>
<span style="color: #6434A3;">integer</span>, <span style="color: #0000FF;">target</span> ::<span style="color: #BA36A5;"> a = 1, b = 2</span>
<span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">declare pointer</span>
<span style="color: #6434A3;">integer</span>, <span style="color: #0000FF;">pointer</span> ::<span style="color: #BA36A5;"> p</span>

p =&gt; a <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Now 'p' has same memory address as 'a'</span>
p = <span style="color: #D0372D;">2</span> <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Modify value at address</span>
<span style="color: #0000FF;">print</span>*, a==<span style="color: #D0372D;">2</span> <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">'a' is 2</span>

p =&gt; b <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Now 'p' has same memory address as 'b'</span>
p = <span style="color: #D0372D;">1</span> <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Modify value at address</span>
<span style="color: #0000FF;">print</span>*, b==<span style="color: #D0372D;">1</span> <span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">'b' is 1</span>

<span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Is 'p' associated with a target?</span>
<span style="color: #0000FF;">print</span>*, <span style="color: #0000FF;">associated</span><span style="color: #707183;">(</span>p<span style="color: #707183;">)</span>

<span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Is 'p' associated with the target 'a'?</span>
<span style="color: #0000FF;">print</span>*, <span style="color: #0000FF;">associated</span><span style="color: #707183;">(</span>p, a<span style="color: #707183;">)</span>

<span style="color: #8D8D84;">! </span><span style="color: #8D8D84; font-style: italic;">Point to nowhere</span>
<span style="color: #0000FF;">nullify</span><span style="color: #707183;">(</span>p<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">3.8</span> Arrays</h3>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">4</span> Control structures</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
</div>
</body>
</html>
